; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v3)
		(pred_3 ?v2)
		(pred_1 ?v8)
		(pred_4 ?v8)
		(pred_6 ?v2 ?v8)
		(pred_2)
		(pred_5 ?v2))

   (:action op_3
       :parameters  (?v1 ?v6)
       :precondition (and (not-eq ?v1 ?v6) 
                          (pred_1 ?v1) (pred_1 ?v6) (pred_4 ?v1))
       :effect (and  (pred_4 ?v6)
		     (not (pred_4 ?v1))))


   (:action op_2
       :parameters (?v5 ?v4)
       :precondition  (and  (pred_3 ?v5) (pred_1 ?v4)
			    (pred_6 ?v5 ?v4) (pred_4 ?v4) (pred_2))
       :effect (and (pred_5 ?v5)
		    (not (pred_6 ?v5 ?v4)) 
		    (not (pred_2))))

   (:action op_1
       :parameters  (?v5  ?v4)
       :precondition  (and  (pred_3 ?v5) (pred_1 ?v4)
			    (pred_5 ?v5) (pred_4 ?v4))
       :effect (and (pred_6 ?v5 ?v4)
		    (pred_2)
		    (not (pred_5 ?v5)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_08 obj_04 obj_05 obj_01 obj_02 obj_07 
          obj_06 obj_03 
)
(:init
(pred_1 obj_08)
(pred_1 obj_04)
(pred_1 obj_05)
(pred_1 obj_01)
(pred_1 obj_02)
(pred_1 obj_07)
(pred_3 obj_06)
(pred_3 obj_03)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(pred_2)
(pred_6 obj_06 obj_07)
(pred_6 obj_03 obj_01)
(pred_4 obj_07)
)
(:goal
(and
(pred_6 obj_06 obj_07)
(pred_6 obj_03 obj_07)
)
)

(:constraints
  (sometime-before  (pred_6 obj_03 obj_07) (pred_4 obj_08))
)
)

; plan
1. (op_2 obj_06 obj_07)
   deleted: (pred_6 obj_06 obj_07) (pred_2)
   added: (pred_5 obj_06)
   goals met: 0 of 2
2. (op_3 obj_07 obj_08)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_08)
   goals met: 0 of 2
3. (op_1 obj_06 obj_08)
   deleted: (pred_5 obj_06)
   added: (pred_6 obj_06 obj_08) (pred_2)
   goals met: 0 of 2
4. (op_3 obj_08 obj_01)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_01)
   goals met: 0 of 2
5. (op_2 obj_03 obj_01)
   deleted: (pred_6 obj_03 obj_01) (pred_2)
   added: (pred_5 obj_03)
   goals met: 0 of 2
6. (op_3 obj_01 obj_07)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_07)
   goals met: 0 of 2
7. (op_1 obj_03 obj_07)
   deleted: (pred_5 obj_03)
   added: (pred_6 obj_03 obj_07) (pred_2)
   goals met: 1 of 2
8. (op_3 obj_07 obj_08)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_08)
   goals met: 1 of 2
9. (op_2 obj_06 obj_08)
   deleted: (pred_6 obj_06 obj_08) (pred_2)
   added: (pred_5 obj_06)
   goals met: 1 of 2
10. (op_3 obj_08 obj_07)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_07)
   goals met: 1 of 2
11. (op_1 obj_06 obj_07)
   deleted: (pred_5 obj_06)
   added: (pred_6 obj_06 obj_07) (pred_2)
   goals met: 2 of 2
